justimepassnow/custom_servo/mm32_test/src/main.c
#include "mm32_device.h"
#include <stdint.h>
#include <stdio.h>

#define BUF_SIZE 32
#define ANGLE_MIN 45
#define ANGLE_MAX 280
#define PID_INTERVAL_MS 1
#define INTEGRAL_LIMIT_Q8 25600 // ~100 degrees max windup limit in Q8
#define DEADBAND_Q8 384         // 1.5 degrees deadband in Q8

// Logging Configuration (Set to 0 for silent multi-servo production daisy-chaining)
#define DEBUG_LOG 1

// Protocol packet parsing states
typedef enum {
    RX_STATE_HEADER1 = 0,
    RX_STATE_HEADER2,
    RX_STATE_ID,
    RX_STATE_LENGTH,
    RX_STATE_INSTRUCTION,
    RX_STATE_PARAMETERS,
    RX_STATE_CHECKSUM
} RxState;

// Configuration structure matching implementation specification (26 bytes)
typedef struct __attribute__((packed)) {
    uint8_t  servo_id;        // 0-253, default: 0
    uint8_t  direction_invert;// 0 = normal, 1 = inverted motor direction
    uint16_t min_angle;       // minimum angle, e.g., 45
    uint16_t max_angle;       // maximum angle, e.g., 280
    uint16_t max_velocity;    // degrees per second, default e.g. 180
    uint16_t current_limit;   // raw current ADC threshold (or mA threshold), default e.g. 1000
    int32_t  kp_q16;          // PID proportional gain
    int32_t  ki_q16;          // PID integral gain
    int32_t  kd_q16;          // PID derivative gain
    uint16_t hard_min_angle;  // physical degree angle at ADC = 0 (default: 0)
    uint16_t hard_max_angle;  // physical degree angle at ADC = 4095 (default: 300)
    uint32_t magic;           // 0xDEADBEEF Magic Word
} ServoConfig;

// Global variables
ServoConfig config;
uint32_t SystemCoreClock = 8000000U;

// PID active fixed-point gains (pre-calculated for 1ms time-step)
volatile int32_t Kp_q16;
volatile int32_t Ki_q16;
volatile int32_t Kd_q16;

// PID state variables (pure integer, Q8 fixed-point format)
int32_t pid_error = 0;
int32_t prev_error = 0;
int32_t pid_integral = 0;
int32_t pid_derivative = 0;

// Motion target, trajectory profiling (Ghost Target) and feedback
volatile int32_t target_angle = 150;      // default target (degrees)
volatile int32_t ghost_angle_q8 = 150*256; // Ghost Target in Q8
volatile int32_t current_angle = 0;       // Current physical angle
volatile uint16_t active_velocity = 180;  // Active velocity in deg/s
volatile uint8_t status_reporting_enabled = 0;

// Safety and Fault Management flags
volatile uint8_t overcurrent_fault = 0;
volatile uint8_t stall_fault = 0;
volatile uint32_t overcurrent_ms = 0;
volatile uint8_t motor_armed = 0; // Arm on first valid CONTROL packet
volatile int32_t zero_current_offset_adc = 0; // Startup auto-zero calibration offset

void print_status(void);
int32_t read_current_ma(void);

// Flash Erase/Write Helper Functions
void flash_erase_page(uint32_t address) {
    if (READ_BIT(FLASH->CR, FLASH_CR_LOCK)) {
        WRITE_REG(FLASH->KEYR, 0x45670123);
        WRITE_REG(FLASH->KEYR, 0xCDEF89AB);
    }
    WRITE_REG(FLASH->SR, FLASH_SR_EOP | FLASH_SR_WRPRTERR | FLASH_SR_PGERR);
    SET_BIT(FLASH->CR, FLASH_CR_PER);
    WRITE_REG(FLASH->AR, address);
    SET_BIT(FLASH->CR, FLASH_CR_STRT);
    while (READ_BIT(FLASH->SR, FLASH_SR_BSY));
    CLEAR_BIT(FLASH->CR, FLASH_CR_PER);
    WRITE_REG(FLASH->SR, FLASH_SR_EOP | FLASH_SR_WRPRTERR | FLASH_SR_PGERR);
}

void flash_write_halfword(uint32_t address, uint16_t data) {
    SET_BIT(FLASH->CR, FLASH_CR_PG);
    *(volatile uint16_t *)address = data;
    while (READ_BIT(FLASH->SR, FLASH_SR_BSY));
    CLEAR_BIT(FLASH->CR, FLASH_CR_PG);
    WRITE_REG(FLASH->SR, FLASH_SR_EOP | FLASH_SR_WRPRTERR | FLASH_SR_PGERR);
}

void flash_write_config(ServoConfig *cfg) {
    // 1. Temporarily force motor compare registers to 0 for safety
    TIM_SetCompare3(TIM1, 0);
    TIM_SetCompare2(TIM1, 0);

    // 2. Erase flash page 15 (last 1KB of 16KB FLASH, starting at 0x08003C00)
    flash_erase_page(0x08003C00);

    // 3. Write config struct (rounded up to write final odd byte safely if struct size changes, pure compile-time integer math)
    uint16_t *src = (uint16_t *)cfg;
    for (size_t i = 0; i < (sizeof(ServoConfig) + 1) / 2; i++) {
        flash_write_halfword(0x08003C00 + i * 2, src[i]);
    }

    // 4. Re-lock Flash Memory
    SET_BIT(FLASH->CR, FLASH_CR_LOCK);
}

void flash_load_config(ServoConfig *cfg) {
    ServoConfig *flash_cfg = (ServoConfig *)0x08003C00;
    if (flash_cfg->magic == 0xDEADBEEF) {
        *cfg = *flash_cfg;
    } else {
        // Load default parameters
        cfg->servo_id = 0; // Default ID is 0 as explicitly requested!
        cfg->direction_invert = 0; // Default direction: normal (0)
        cfg->min_angle = 45;
        cfg->max_angle = 280;
        cfg->max_velocity = 180; // default 180 degrees/sec
        cfg->current_limit = 1000; // raw threshold/mA limit
        cfg->kp_q16 = 6553600;     // Kp = 100.0 * 65536
        cfg->ki_q16 = 3276;        // Ki = 0.05 * 65536 (unscaled)
        cfg->kd_q16 = 524288;      // Kd = 8.0 * 65536 (unscaled)
        cfg->hard_min_angle = 0;   // Default 0 deg at ADC = 0
        cfg->hard_max_angle = 300; // Default 300 deg at ADC = 4095
        cfg->magic = 0xDEADBEEF;

        // Persist default config to flash
        flash_write_config(cfg);
    }

    // Precalculate active fixed-point gains scaled for 1ms task interval (dt = 0.001s)
    Kp_q16 = cfg->kp_q16;
    Ki_q16 = cfg->ki_q16 / 1000; // scaled by dt (0.001)
    if (Ki_q16 < 1 && cfg->ki_q16 > 0) Ki_q16 = 1; // prevent underflow loss if small
    Kd_q16 = cfg->kd_q16 * 1000; // scaled by 1/dt (1000)
}

// System Init
void SystemInit(void) {
    RCC->CR |= RCC_CR_HSION;
    while (!(RCC->CR & RCC_CR_HSIRDY));
    
    FLASH->ACR &= ~FLASH_ACR_LATENCY_Msk;
    FLASH->ACR |= FLASH_ACR_LATENCY_1;
    FLASH->ACR |= FLASH_ACR_PRFTBE;
    
    RCC->CFGR &= ~RCC_CFGR_HPRE_Msk;
    RCC->CFGR |= (0x00U << RCC_CFGR_HPRE_Pos);
    
    RCC->CFGR &= ~RCC_CFGR_PPRE1_Msk;
    RCC->CFGR |= (0x04U << RCC_CFGR_PPRE1_Pos);
    
    RCC->CFGR &= ~RCC_CFGR_SW_Msk;
    RCC->CFGR |= (0x02U << RCC_CFGR_SW_Pos);
    
    while ((RCC->CFGR & RCC_CFGR_SWS_Msk) != (0x02U << RCC_CFGR_SWS_Pos)) {
        __ASM("nop");
    }
    
    SystemCoreClock = 48000000U;
}

void delay_ms(uint32_t ms) {
    for (volatile uint32_t i = 0; i < ms * 6000; i++) {
        __ASM("nop");
    }
}

// UART Half-Duplex Single-Wire Helper Functions
void uart_enable_tx(void) {
    USART_RxCmd(USART1, DISABLE);
    USART_TxCmd(USART1, ENABLE);
}

void uart_enable_rx(void) {
    while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET);
    USART_TxCmd(USART1, DISABLE);
    USART_RxCmd(USART1, ENABLE);
}

void uart_init(void) {
    GPIO_InitTypeDef GPIO_InitStruct;
    USART_InitTypeDef USART_InitStruct;

    RCC_AHBPeriphClockCmd(RCC_AHBPERIPH_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_USART1, ENABLE);

    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_12;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_AF_OD; // Open-Drain for single-wire Shared Bus
    GPIO_Init(GPIOA, &GPIO_InitStruct);

