justimepassnow/custom_servo/mm32_test/src/main.c
    if (!motor_armed) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    static int32_t filtered_adc_q8 = -1;

    // 1. Read potentiometer raw ADC and apply low pass filter
    uint16_t raw_adc = adc_read(ADC_Channel_7);
    if (filtered_adc_q8 < 0) {
        filtered_adc_q8 = ((int32_t)raw_adc) << 8;
    } else {
        // alpha = 0.10 -> Q8 equivalent is 26/256
        filtered_adc_q8 = (26 * (((int32_t)raw_adc) << 8) + 230 * filtered_adc_q8) >> 8;
    }

    // 2. Convert to Q8 angle using high-precision linear interpolation of hard calibration limits
    // Retains all 8 bits of fractional filtering smoothness from filtered_adc_q8!
    int32_t sweep = config.hard_max_angle - config.hard_min_angle;
    int32_t current_angle_q8 = (sweep * filtered_adc_q8) / 4095 + (config.hard_min_angle << 8);
    
    // Update global degree angle (round Q8 to integer)
    current_angle = (current_angle_q8 + 128) >> 8;

    // 3. Compute error relative to the Ghost Target
    pid_error = ghost_angle_q8 - current_angle_q8;

    // 4. Check Deadband (only when Ghost Target has fully caught up to final target)
    if (ghost_angle_q8 == (target_angle << 8)) {
        int32_t abs_error = (pid_error >= 0) ? pid_error : -pid_error;
        if (abs_error < DEADBAND_Q8) {
            // Idle state: hold both inputs HIGH (100% duty) for active braking/slow decay
            TIM_SetCompare3(TIM1, arr_period);
            TIM_SetCompare2(TIM1, arr_period);
            pid_integral = 0;
            prev_error = 0;
            if (status_reporting_enabled) {
                status_reporting_enabled = 0;
#if DEBUG_LOG
                print_status();
                uart_print("[STATUS] Target reached! Motor is now idle.\r\n");
#endif
            }
            return;
        }
    }

    // 5. Calculate P, I, D outputs using Q24 scaling
    int64_t p_term = (int64_t)Kp_q16 * (int64_t)pid_error;

    pid_integral += pid_error;
    if (pid_integral > INTEGRAL_LIMIT_Q8) pid_integral = INTEGRAL_LIMIT_Q8;
    else if (pid_integral < -INTEGRAL_LIMIT_Q8) pid_integral = -INTEGRAL_LIMIT_Q8;
    
    int64_t i_term = (int64_t)Ki_q16 * (int64_t)pid_integral;

    pid_derivative = pid_error - prev_error;
    prev_error = pid_error;
    
    int64_t d_term = (int64_t)Kd_q16 * (int64_t)pid_derivative;

    int64_t pid_out_q24 = p_term + i_term + d_term;
    int32_t pid_out = (int32_t)(pid_out_q24 >> 24);

    // 6. Direct PWM generation
    int32_t pulse = (pid_out >= 0) ? pid_out : -pid_out;
    if (pulse > (int32_t)arr_period) {
        pulse = (int32_t)arr_period;
    }

    int8_t drive_direction = (pid_out >= 0) ? 1 : -1;
    if (config.direction_invert) {
        drive_direction = -drive_direction; // Swap effective direction
    }

    if (drive_direction > 0) {
        // Forward Direction (IN1 [CH3] = 100% High, IN2 [CH2] = Inverted PWM)
        TIM_SetCompare3(TIM1, arr_period);
        TIM_SetCompare2(TIM1, arr_period - pulse);
    } else {
        // Backward Direction (IN1 [CH3] = Inverted PWM, IN2 [CH2] = 100% High)
        TIM_SetCompare3(TIM1, arr_period - pulse);
        TIM_SetCompare2(TIM1, arr_period);
    }
}

// 1ms Critical Task Loop (Trajectory Ramping & Protection Checks)
void one_ms_task(uint32_t arr_period) {
    // 1. Trajectory Profiling (Velocity control of Ghost Target)
    int32_t target_angle_q8 = target_angle << 8;
    int32_t step_q8 = ((int32_t)active_velocity * 32) / 125; // (velocity * 256) / 1000
    if (step_q8 < 1) step_q8 = 1;
    
    if (ghost_angle_q8 < target_angle_q8) {
        ghost_angle_q8 += step_q8;
        if (ghost_angle_q8 > target_angle_q8) {
            ghost_angle_q8 = target_angle_q8;
        }
    } else if (ghost_angle_q8 > target_angle_q8) {
        ghost_angle_q8 -= step_q8;
        if (ghost_angle_q8 < target_angle_q8) {
            ghost_angle_q8 = target_angle_q8;
        }
    }

    // 2. Over-Current Protection
    int32_t current_ma = read_current_ma();
    if (current_ma > (int32_t)config.current_limit) {
        overcurrent_ms++;
        if (overcurrent_ms >= 5) {
            overcurrent_fault = 1;
            TIM_SetCompare3(TIM1, 0);
            TIM_SetCompare2(TIM1, 0);
        }
    } else {
        overcurrent_ms = 0;
    }

    // 3. Stall Detection (evaluated once every 100ms)
    static uint32_t last_stall_check_time = 0;
    static int32_t last_angle_q8 = -1;
    if (millis() - last_stall_check_time >= 100) {
        last_stall_check_time = millis();
        uint32_t pulse3 = TIM1->CCR3;
        uint32_t pulse2 = TIM1->CCR2;
        
        if (pulse3 > 0 || pulse2 > 0) { // motor is driven
            int32_t current_angle_q8 = current_angle << 8;
            if (last_angle_q8 >= 0) {
                int32_t delta = current_angle_q8 - last_angle_q8;
                if (delta < 0) delta = -delta;
                
                // 2 degrees in Q8 is 512 counts
                if (delta < 512) {
                    stall_fault = 1;
                    TIM_SetCompare3(TIM1, 0);
                    TIM_SetCompare2(TIM1, 0);
                }
            }
            last_angle_q8 = current_angle_q8;
        } else {
            last_angle_q8 = -1;
        }
    }

    // 4. Execute PID loop
    pid_update(arr_period);
}

// Telemetry output logger
void print_status(void) {
    uart_print("[STATUS] Target: ");
    uart_print_int(target_angle);
    uart_print(" deg | Current: ");
    uart_print_int(current_angle);
    uart_print(" deg | Error: ");
    
    int32_t err = target_angle - current_angle;
    if (err < 0) {
        uart_print("-");
        uart_print_int(-err);
    } else {
        uart_print_int(err);
    }
    
    uart_print(" deg | Current Draw: ");
    uart_print_int(read_current_ma());
    uart_print(" mA | Duty: ");
    
    uint32_t pulse3 = TIM1->CCR3;
    uint32_t pulse2 = TIM1->CCR2;
    uint32_t arr = TIM1->ARR;
    if (arr == 0) arr = 1;
    
    if (pulse3 > 0) {
        uart_print_int((pulse3 * 100) / arr);
        uart_print("% (PA6 Forward)\r\n");
    } else if (pulse2 > 0) {
        uart_print_int((pulse2 * 100) / arr);
        uart_print("% (PA8 Backward)\r\n");
    } else {
        uart_print("0% (Idle/Deadband)\r\n");
    }
}

void calibrate_current_sensor(void) {
    int32_t sum = 0;
    // Take 16 quick sequential readings to calculate a clean average offset
    for (int i = 0; i < 16; i++) {
        sum += adc_read(ADC_Channel_5); // PA2 maps to ADC1_VIN[5]
        delay_ms(1);
    }
    zero_current_offset_adc = sum / 16;
    
#if DEBUG_LOG
    uart_print("Current Sensor Baseline Calibrated. Zero-Offset: ");
    uart_print_int(zero_current_offset_adc);
    uart_print(" raw ADC counts.\r\n");
#endif
}

int main(void) {
    GPIO_InitTypeDef        GPIO_InitStruct;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStruct;
    TIM_OCInitTypeDef       TIM_OCInitStruct;

    // 1. Enable 1ms SysTick timekeeping interrupt
    SysTick_Config(48000000U / 1000);

    // 2. Initialize Single-Wire Half-Duplex USART1 at 115200 Baud
    uart_init();
#if DEBUG_LOG
    uart_print("\n--- Smart Servo Overhauled Firmware Init ---\n");
#endif

