justimepassnow/custom_servo/mm32_test/src/main.c
    // 3. Load or initialize Flash Persistent Parameters
    flash_load_config(&config);
#if DEBUG_LOG
    uart_print("Flash Loaded Configuration ID: ");
    uart_print_int(config.servo_id);
    uart_print("\r\n");
#endif

    // 4. Initialize TIM1 and GPIOA
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_TIM1, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPERIPH_GPIOA, ENABLE);

    // 5. Configure TIM1 base for 20kHz motor PWM
    uint32_t TimerClock = TIM_GetTIMxClock(TIM1);
    uint32_t TargetFrequency = 20000;
    uint32_t TimerPeriod = (TimerClock / TargetFrequency) - 1;

    TIM_TimeBaseStructInit(&TIM_TimeBaseStruct);
    TIM_TimeBaseStruct.TIM_Prescaler         = 0;
    TIM_TimeBaseStruct.TIM_CounterMode       = TIM_CounterMode_Up;
    TIM_TimeBaseStruct.TIM_Period            = TimerPeriod;
    TIM_TimeBaseStruct.TIM_ClockDivision     = TIM_CKD_Div1;
    TIM_TimeBaseStruct.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStruct);

    // 6. Initialize TIM1 CH3 and CH2 output channels
    TIM_OCStructInit(&TIM_OCInitStruct);
    TIM_OCInitStruct.TIM_OCMode       = TIM_OCMode_PWM1;
    TIM_OCInitStruct.TIM_OutputState  = TIM_OutputState_Enable;
    TIM_OCInitStruct.TIM_Pulse        = 0;
    TIM_OCInitStruct.TIM_OCPolarity   = TIM_OCPolarity_High;
    TIM_OCInitStruct.TIM_OCIdleState  = TIM_OCIdleState_Set;
    TIM_OC3Init(TIM1, &TIM_OCInitStruct); // Channel 3 (PA6)
    TIM_OC2Init(TIM1, &TIM_OCInitStruct); // Channel 2 (PA8)

    // 7. Configure pin AF multiplexing
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_4);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_1);

    // 8. Configure Alternate Function push-pull pins for PWM channels
    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_6 | GPIO_Pin_8;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    // 9. Configure Software Reset button on PA5
    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_5;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    // 10. Initialize ADC on PA7 and PA2
    adc_init();

    // Calibrate current sensor baseline offset (Auto-Zeroing)
    calibrate_current_sensor();

    // 11. Enable TIM1 Main Outputs
    TIM_Cmd(TIM1, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);

    // 12. Soft Start: read current position to lock initial target securely
    uint16_t init_raw_adc = adc_read(ADC_Channel_7);
    int32_t sweep = config.hard_max_angle - config.hard_min_angle;
    int32_t init_angle_q8 = (sweep * (int32_t)init_raw_adc * 256) / 4095 + (config.hard_min_angle << 8);
    current_angle = (init_angle_q8 + 128) >> 8;
    target_angle = current_angle;
    ghost_angle_q8 = init_angle_q8;
    active_velocity = config.max_velocity;

#if DEBUG_LOG
    uart_print("Soft-Start Complete. Locked Initial Angle: ");
    uart_print_int(current_angle);
    uart_print(" deg.\r\n");
#endif

    static uint32_t last_pid_time = 0;

    while (1) {
        // A. Software System Reset Trigger (Debounced reset button on PA5)
        if (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_5) == Bit_RESET) {
#if DEBUG_LOG
            uart_print("\r\n[RESET] Triggering Software Reset...\r\n");
#endif
            delay_ms(50);
            NVIC_SystemReset();
        }

        // B. Process non-blocking packet bus parser
        process_packet_input();

        // C. Update Trajectory ramps, protections, and PID loop strictly every 1ms
        if (millis() - last_pid_time >= PID_INTERVAL_MS) {
            last_pid_time = millis();
            one_ms_task(TimerPeriod);
        }

        // D. Periodic logging disabled for production to keep single-wire bus clear.
        // The master reads current and position via binary STATUS REPLY packets.

        // E. Prevent cycle spinning overload
        // (Removed delay_ms(1) to run at full speed and avoid UART overrun)
    }
}
